
// Task 1 ============================================
/*  Дано блок .div-1. Всередині блоку - зображення 1.png. При натисканні правою кнопкою миші - змінюйте зображення на 2.png. Сподіваюся ви здогадаєтеся змінити тільки src зображення? */

function t1() {

}




// Task 2 ============================================
/*  Даний блок .div-2. Всередині блоку - зображення 1.png. При наведенні миші (mouseenter) -
    змінюйте зображення на 2.png. */

function t2() {

}



// Task 3 ============================================
/*  Дано блок .div-3. Всередині блоку - зображення 1.png. При наведенні миші (mouseenter) – змінюйте зображення на 2.png. При відведенні миші - mouseleave, повертайте вихідне зображення. */

function t3() {

}



// Task 4 ============================================
/*  Дано блок div-4. Напишіть функцію t4 яка виводить в даний блок його ширину при події onmouseenter.  */

function t18() {

}
