
// Task 1 ============================================
/*  Дано блок div-1. Додайте на нього подію touchmove. При спрацюванні події – збільшуйте його ширину на 1. */

function t1() {

}


// Task 2 ============================================
/*  Перегляньте  html код усередині div-2-wrapper.

1. Додайте на кнопку nex подію click, touch так, щоб при події запускалася функція nextFunction та активним ставало зображення наступне за виділеним класом active-img (рамкою). Відповідно, на активному зображенні з'являється рамка, інші - позбавляються рамки.

2. Додайте кнопку prev подію click, touch так, щоб при події запускалася функція prevFunction і активним ставало зображення до виділеного класом active-img (рамкою). Відповідно, на активному зображенні з'являється рамка, інші - позбавляються рамки.

3. Врахуйте крайові ефекти - коли ми доходимо до кінця або початку, то натискання кнопки повинно призводити до переміщення рамки на початок або кінець зображень.

4. Додайте кнопку reset (функція resetFunction), натискання якої скидає активне зображення на нульове.

5. Додайте до всіх дій наступне - у зображенні img-12-max замінюється src на активну. Тобто. сталася подія – замінилася головна картинка.
*/

const images = document.querySelectorAll('.img-2-min');
let count = 0; // переменная, которая указывает на номер активного изображения в images

const next = document.querySelector('.next');
next.onclick = nextFunction;

const prev = document.querySelector('.prev');
prev.onclick = prevFunction;

function nextFunction() {

}

function prevFunction() {

}


// ваше событие здесь!!!
